CPS-Projet/spec_modif/terrain.tex
% Created 2014-04-07 lun. 15:49
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{amssymb}
\usepackage{hyperref}


\title{terrain}
\author{BUNEL QUENTIN}
\date{07 avril 2014}

\begin{document}

\maketitle

\setcounter{tocdepth}{3}
\tableofcontents
\vspace*{1cm}
\section{Terrain}
\label{sec-1}

\subsection{service : Terrain}
\label{sec-1.1}

\subsection{use : \href{file:///users/Etu5/3000675/Desktop/spec/bloc.org}{Bloc}}
\label{sec-1.2}

\subsection{types : int, Bloc[][][]}
\label{sec-1.3}



\subsection{observators :}
\label{sec-1.4}

\subsubsection{}

\begin{itemize}

\item const largeur : [Terrain] → int\\
\label{sec-1.4.1.1}


\item const hauteur : [Terrain] → int\\
\label{sec-1.4.1.2}


\item const profondeur : [Terrain] → int\\
\label{sec-1.4.1.3}


\item getBloc : [Terrain] × int × int × int → Bloc\\
\label{sec-1.4.1.4}

\begin{itemize}

\item pre getBloc(T,i,j,k) require (0 ≤ i < (largeur(T)/Bloc::largeur())) ∧ (0 ≤ j < (profondeur(T)/Bloc::profondeur())) ∧ (0 ≤ k < (hauteur(T)/Bloc::hauteur()))\\
\label{sec-1.4.1.4.1}


\end{itemize} % ends low level
\end{itemize} % ends low level
\subsection{Constructors :}
\label{sec-1.5}

\subsubsection{}

\begin{itemize}

\item init : int × int × int → [Terrain]\\
\label{sec-1.5.1.1}

\begin{itemize}

\item pre init(largeur,hauteur,profondeur) require largeur > 0 ∧ hauteur > 0 ∧ profondeur > 0\\
\label{sec-1.5.1.1.1}


\end{itemize} % ends low level
\end{itemize} % ends low level
\subsection{Observations :}
\label{sec-1.6}


\subsubsection{[init]}
\label{sec-1.6.1}

\begin{itemize}

\item largeur(init(l,h,p)) = l\\
\label{sec-1.6.1.1}


\item hauteur(init(l,h,p)) = h\\
\label{sec-1.6.1.2}


\item profondeur(init(l,h,p)) = p\\
\label{sec-1.6.1.3}


\item getBloc(init(l,h,p),x,y,z) ≠ null avec\\
\label{sec-1.6.1.4}

\begin{itemize}

\item ∀x ∈ [0;largeur(init(l,h,p))],\\
\label{sec-1.6.1.4.1}


\item ∀y ∈ [0;profondeur(init(l,h,p))],\\
\label{sec-1.6.1.4.2}


\item ∀z ∈ [0;hauteur(init(l,h,p))],\\
\label{sec-1.6.1.4.3}

\end{itemize} % ends low level
\end{itemize} % ends low level

\end{document}
